[
    {
        "title": "Method of Equal Shares in Practice",
        "speaker": "Piotr Faliszewski",
        "affiliation": "AGH University, Kraków, Poland",
        "abstract": "The idea of participatory budgeting is that a city allows its inhabitants to choose how some amount of budget is spent. Typically, the most active citizens first propose possible projects to implement and, then, the people vote on which of them should be carried out. While in principle this is a very attractive idea, most cities that implement participatory budgeting use a simple, greedy voting method, which promotes undesirable behavior (such as merging projects that are only loosely connected). Method of Equal Shares (MES) is a recently introduced voting rule for participatory budgeting that guarantees strong proportionality and fairness properties. In this talk, we will introduce MES, discuss how it was implemented in practical settings, and how formal methods helped in both using the rule and convincing the cities to use it (up to now, six different municipalities in several different countries adopted the rule).",
        "bio": "Piotr Faliszewski is a Full Professor of Computer Science at AGH University of Science and Technology in Kraków, Poland. His research interests include computational social choice, preference aggregation, complexity of elections, cooperative game theory, algorithms, and approximation algorithms. He received his Ph.D. in Computer Science from the University of Rochester in 2008 and his Habilitation in Computer Science from AGH University of Science and Technology in 2013. He was granted the title of Professor of Computer Science in 2021. Faliszewski has held academic positions at several institutions, including AGH University of Science and Technology, Université Paris-Dauphine, and Technische Universität Berlin. He has received numerous honors, including the Friedrich Wilhelm Bessel Research Award from the Alexander von Humboldt Foundation in 2018 and the Research Prize from Polityka magazine in 2013. He has also been nominated for multiple best paper awards and has a substantial record of publications in top-tier journals and conferences.",
        "image": "./images/seminars/piotr.jpeg",
        "when": "11th of September (11:00), 2024",
        "where": "Valletta Puggia, Room 217"
    },
    {
        "title": "Psychoanalysis of ChatGPT",
        "speaker": "Georg Gottlob",
        "affiliation": "Università della Calabria",
        "abstract": "ChatGPT and other LLMs are the most recent major outcome of the ongoing Ai revolution. The talk begins with a brief discussion of such (text-based) generative AI tools and showcases instances where these models excel, namely when it comes to generating beautifully composed texts. We then discuss shortcomings of LLM, especially where they produce erroneous information. This is often the case when they are prompted for data that are not already present in Wikipedia or other authoritative Web sources. To understand why so many errors and 'hallucinations' occur, we report about our findings about the 'psychopathology of everyday prompting' and identify and illustrate several key reasons for potential failures in language models, which include, but are not limited to: (i) information loss due to data compression, (ii) training bias, (iii) the incorporation of incorrect external data, (iv) the misordering of results, and (v) the failure to detect and resolve logical inconsistencies contained in a sequence of LLM-generated prompt-answers. In the second part of the talk, we give a survey of Chat2Data project, which endeavors to leverage language models for the automated verification and enhancement of relational databases, all while mitigating the pitfalls (i)–(v) mentioned earlier.",
        "bio": "Georg Gottlob is a Professor Georg Gottlob is a Professor of Computer Science at the University of Calabria. Until recently, he was a Royal Society Research Professor at the Computer Science Department of the University of Oxford, a Fellow of St John's College, Oxford, and an Adjunct Professor at TU Wien. Long time ago, he was a CNR-researcher at the University of Genoa. His interests include knowledge representation, database theory, query processing, web data extraction, and (hyper)graph decomposition techniques. Gottlob has received the Wittgenstein Award from the Austrian National Science Fund and the Ada Lovelace Medal (UK). He is an ACM Fellow, an ECCAI Fellow, a Fellow of the Royal Society, and a member of the Austrian Academy of Sciences, the German National Academy of Sciences, and the Academia Europaea. He chaired the Program Committees of IJCAI 2003 and ACM PODS 2000 and is on the Editorial Boards of JACM and JCSS. He was a founder of Lixto, a web data extraction firm acquired in 2013 by McKinsey & Company. In 2015 he co-founded Wrapidity, a spin out of Oxford University based on fully automated web data extraction technology developed in the context of an ERC Advanced Grant.. Gottlob then co-founded the Oxford spin-out DeepReason.AI, which provided knowledge graph and rule- based reasoning software to customers in various industries. Both Wrapidity and DeepReasonAI were acquired by Meltwater, an internationally operating media intelligence company.",
        "image": "./images/seminars/georggottlob.jpeg",
        "when": "20th of May (14:00), 2024",
        "where": "Valletta Puggia, Room 322"
    },
    {
        "title": "Extensible proof-systems for modal logics",
        "speaker": "Margherita Zorzi",
        "affiliation": "Università di Verona",
        "abstract": "Proof theory offers various approaches to modal logic, each incorporating varying levels of additional technology into the fundamental formats, such as deduction, sequent calculi, tableaux, etc., to effectively handle modalities. Similar to first-order systems, a modal deductive system should embody the following critical attributes: simplicity, analyticity, properties of cut elimination or normalization, and modularity. In this talk, our focus will be on the \"geometric\" approach, which extends formulas using a notion of position (originating from 2-sequents developed in the early 1990s). We will explore the fundamental concepts for handling various logics between K and S5, focusing on the intermediate system S4.2.",
        "bio": "Dr. Margherita Zorzi, Ph.D, is an Assistant Professor at the Department of Computer Science, Università degli Studi di Verona, specializing in Mathematical Logic, Logical Methods in Computer Science, and Quantum Computing. She is a member of the LOGICA research group and the QUILAB (Quantum Informatics LABoratory), where she focuses on Quantum Logics and Quantum Measurements. With extensive experience in teaching courses on Mathematical Logic and Informatics, Dr. Zorzi has authored numerous papers in international journals and presented at prestigious conferences. She holds national and international qualifications in Logic and Computer Science, demonstrating her expertise and dedication to advancing the field.",
        "image": "./images/seminars/margheritazorzi.jpeg",
        "when": "9th of May (16:00), 2024",
        "where": "Valletta Puggia, Room 704"
    },
    {
        "title": "On Model-Checking Higher-Order Effectful Programs",
        "speaker": "Ugo Dal Lago",
        "affiliation": "Università di Bologna",
        "abstract": "Model-checking is one of the most powerful techniques for verifying systems and programs, which since the pioneering results by Knapik et al., Ong, and Kobayashi, is known to be applicable to functional programs with higher-order types against properties expressed by formulas of monadic second-order logic. What happens when the program in question, in addition to higher-order functions, also exhibits algebraic effects such as probabilistic choice or global store? The results in the literature range from those, mostly positive, about nondeterministic effects, to those about probabilistic effects, in the presence of which even mere reachability becomes undecidable. This work takes a fresh and general look at the problem, first of all showing that there is an elegant and natural way of viewing higher-order programs producing algebraic effects as ordinary higher-order recursion schemes. We then move on to consider effect handlers, showing that in their presence the model checking problem is bound to be undecidable in the general case, while it stays decidable when handlers have a simple syntactic form, still sufficient to capture so-called generic effects. Along the way, we hint at how a general specification language could look like, this way justifying some of the results in the literature, and deriving new ones.",
        "bio": "Ugo Dal Lago is full professor of Computer Science since 2019 and a faculty member of the Computer Science Lab since 2006. Before that, he has been a postdoc in Verona and Paris. He has been involved in many international research projects; currently, he is principal investigator of the ERC CoG project \"Differential Program Semantics\". He co-authored more than 100 publications which appeared in journals and conference proceedings. He is the winner of the prize for the best italian doctoral thesis in theoretical computer science (2006), of the Kleene Award (2006) and of the prize for the best young researcher in theoretical computer science (2015).",
        "image": "./images/seminars/ugodallago.jpeg",
        "when": "24th of April (11:15), 2024",
        "where": "Valletta Puggia, Room 322"
    },
    {
        "title": "Sound Control Synthesis with Logic and Data",
        "speaker": "Alessandro Abate",
        "affiliation": "Oxford University",
        "abstract": "We are witnessing an inter-disciplinary convergence between scientific areas underpinned by model-based reasoning and by data-driven learning. Access to information-rich data has to be traded off with a demand for safety criticality: cyber-physical systems are exemplar applications. In this talk, I shall report on ongoing research in this cross-disciplinary domain at OXCAV, the Oxford Control and Verification group.  In particular, I shall present recent work on CEGIS, a ``counterexample-guided inductive synthesis'' framework for sound synthesis tasks that are relevant for dynamical models, control problems, and software programs. I shall elucidate the ins&outs of the CEGIS framework, and display its workings on a few problems: synthesis of certificates for dynamical and control models; hybridisation of nonlinear dynamics for safety verification; and an application in real-time autonomy.",
        "bio": "Alessandro Abate is Professor of Verification and Control in the Department of Computer Science at the University of Oxford, where he also served as Deputy Head. Earlier, he did research at Stanford University and at SRI International, and was an Assistant Professor at the Delft Center for Systems and Control, TU Delft. He received a Laurea degree from the University of Padua and MS/PhD at UC Berkeley. His research work spans logic, probability, control, and AI.",
        "image": "./images/seminars/alessandroabate.jpeg",
        "when": "19th of April (14:00), 2024",
        "where": "Viale Causa 13, Aula Tagliasco",
        "slides": "./data/slides/Abate19042024.pdf"
    },
    {
        "title": "Lawvere Metric Spaces and Quantales",
        "speaker": "Eugenio Moggi",
        "affiliation": "University of Genova",
        "abstract": "In a 1973 paper Lawvere proposes to view metric spaces as R-enriched categories.  We recall the definitions (metric space X, category C, monoidal category V, V-enriched category C) needed to understand Lawvere's contribution.  We consider a further generalization, where the quantale R is replaces by a generic quantale Q.  We give examples of quantales that arise in several contexts (e.g., in analysis of algorithms), and what are the additional properties of a quantale Q to relate Q-valued metric spaces to topological spaces.",
        "bio": "Professor Eugenio Moggi, MSc from Pisa (1983) and PhD from Edinburgh (1988), has worked at the Univ. of Cambridge, Edinburgh and Pisa, before moving to Genova in 1990.",
        "image": "./images/seminars/eugeniomoggi.jpeg",
        "when": "25th of March (15:00), 2024",
        "where": "Valletta Puggia, Room 218",
        "slides": "./data/slides/Moggi25032024.pdf"
    },
    {
        "title": "Verification of neural-symbolic agent systems",
        "speaker": "Elena Botoeva",
        "affiliation": "University of Kent",
        "abstract": "In this talk I will present a formalisation of closed loop systems comprising neural-symbolic agents and an approach to verify those using fragments of temporal logics. Here we assume a model of agents that are composed of a perception system implemented via feedforward neural networks and an action selection mechanism implemented via traditional control logic. This formalisation admits various instantiations: single or multiple agents, deterministic or non-deterministic environments.  We study the verification problem of such systems against temporal logic properties, for instance branching-time temporal logic (CTL) or alternating-time temporal logic (ATL). We show that verifying these systems against reachability properties is undecidable. We introduce bounded fragments of CTL and ATL, that can be used for identifying shallow bugs in the system, and prove that the verification problem against specifications in these fragments is in coNExpTime and PSpace-hard. We translate the verification problem on bounded traces into the feasibility problem of mixed integer linear programs and show the soundness and completeness of the translation. We present a tool implementing the compilation and evaluate the experimental results obtained on a complex scenario of multiple aircraft operating a recently proposed prototype for air-traffic collision avoidance (VCAS).",
        "bio": "Prior to joining Kent Elena was a Research Associate in the Verification of Autonomous Systems Group at Imperial College London and a Researcher in the KRDB Research Centre for Knowledge and Data at Free University of Bozen-Bolzano. She has a wide range of research experience with theoretical and practical AI problems such as query answering over ontologies, accessing relational and NoSQL databases using ontologies, and verification of autonomous systems with neural network components.",
        "image": "./images/seminars/elenabotoeva.jpeg",
        "when": "14th of February (14:00), 2024",
        "where": "Viale Causa 15, Aula Tagliasco"
    },
    {
        "title": "On the importance and role of Temporal and Epistemic Logics in Agents and Multi-Agent Systems",
        "speaker": "Stefania Costantini",
        "affiliation": "University of L'Aquila",
        "abstract": "In the multi-agent setting, it is relevant to model group dynamics of agents, and epistemic logic has proved a good tool. We illustrate an epistemic logic that allows one to formalise the new beliefs formed or removed by a group of agents where several groups can co-exist and where an agent can pass from one group to another. This accounts for modelling aspects of a \"Theory of Mind\" in Multi-Agent Systems. We present some significant case studies, arguing that the epistemic logic representation may enable explainability. We then discuss how temporal-logic-based representations enable forms of agents' run-time self-checking and self-improvement, complementary to other existing ones.",
        "bio": "Stefania Costantini, a Full Professor at the University of L'Aquila since 2005, is a leading expert in Artificial Intelligence (AI). As head of the AAAI@AQ Research Group, she focuses on Intelligent Agents, Answer Set Programming, and Cognitive Robotics. With 150+ international publications, Stefania is active in AI community leadership roles, including serving on conference committees and editorial boards. She is the President of GULP, holds key positions in AIxIA and ALP, and serves as an evaluator for national and international institutions. Stefania's global impact extends to projects like COST CA17124 'DIGital FORensics' and PRIN 2022 TrustPACTX, showcasing her leadership in European, Italian, and industrial AI initiatives.",
        "image": "./images/seminars/stefaniacostantini.jpeg",
        "when": "15th of January, 2024",
        "where": "Valletta Puggia, Room 711"
    },
    {
        "title": "Parameterised Verification of Networks with Rendez-Vous",
        "speaker": "Arnaud Sangnier",
        "affiliation": "University of Genoa",
        "abstract": "We investigate networks of processes using a finite-state protocol and rendezvous communication. Our focus is on verifying properties within this model. We revisit established results and the connection between these networks and Petri nets. Additionally, we introduce new findings concerning the possibility of determining a cutoff number for a given protocol. We establish decidability and complexity results under various assumptions. Further, we provide complexity results for safety verification under a relaxed rendezvous mechanism, aligning with synchronization in languages like Java. These findings are a collaboration with Florian Horn, Lucie Guillou, and Nathalie Sznajder.",
        "bio": "Arnaud Sangnier obtained his PhD at the Laboratoire Spécification et Vérification of ENS Cachan (France) in 2008. His doctoral thesis was on the automatic verification of programs manipulating pointers and counters. During the year 2009, he did a post-doctoral stay at the university of Torino where he studied together with Jeremy Sproston probabilistic systems equipped with counters à la Petri nets. After that he spent 9 month at Genova to work with Giorgio Delzanno on the verification of parameterized networks. From autumn 2010 to autumn 2023, he was associate professor at the University Paris Cité and member of the Institut de Recherche en Informatique Fondamentale (IRIF). He is now associate professor at the University of Genova and member of the Dipartimento di Informatica, Bioingegneria, Robotica e Ingegneria dei Sistemi (DIBRIS). During the last years he has continued to work in both directions of parameterized verification and analysis of systems with counters.",
        "image": "./images/seminars/arnaudsangnier.jpeg",
        "when": "21st of December, 2023",
        "where": "Valletta Puggia, Room 218"
    },
    {
        "title": "ML-based anomaly detection and Formal Methods for ML",
        "speaker": "Claudia Cavallaro",
        "affiliation": "University of Catania",
        "abstract": "Anomaly Detection is a field of data mining that deals with identifying data anomalies in a dataset. Anomalies can be due to measurement errors, unexpected events or malicious attacks. This talk aims to provide an overview of anomalies in fields such as industrial control systems, intrusion systems, the analysis of climate events, urban traffic, fake news and much more. Formal Methods provide a valuable aid to Anomaly Detection, supporting the learning process or data augmentation. Formal methods can improve the generalization of the resulting model after training and guide the learning process to respect certain properties such as constraints. Therefore, applications of Formal Methods  contribute to improving the robustness of Machine Learning (ML) models.",
        "bio": "Claudia Cavallaro is a Researcher in Computer Science at the University of Catania, works on Big Data, Optimization and Metaheuristics. She is a member of Complex Intelligent Systems Research Group of the Department of Mathematics and Computer Science of the University of Catania. She participated as a speaker at the conferences ITADATA 2023 (The 2nd Italian Conference on Big Data and Data Science) and WIVACE 2023 (XVII International Workshop on Artificial Life and Evolutionary Computing). She started working in the research field of Anomaly Detection since her postdoc position at the CNAF-I.N.F.N. from Bologna.",
        "image": "./images/seminars/claudiacavallaro.jpeg",
        "when": "22nd of November, 2023",
        "where": "Valletta Puggia, Room 218"
    },
    {
        "title": "Enforcing Modular Security through Language Design: A Study on Object and Reference Capabilities",
        "speaker": "Marco Servetto",
        "affiliation": "Victoria University of Wellington, NZ",
        "abstract": "We present an approach to language design aimed at enforcing modular security, where a security architect can define specific object capabilities that enforce custom security properties. Unlike traditional models that assume an uncompromised system ('clean garden'), this model ('dark forest') assumes local machines are already compromised but anchored by a secure root. Security is maintained even in the presence of adversarial code execution within security-critical processes: a process may be rendered inert, or be subjected to crashes or infinite loops, but it is precluded from engaging in insecure interactions.",
        "bio": "Marco Servetto is a researcher in Programming languages, type and theory. He is interested in the formal modelling of the semantic of programming languages, with a focus on the intersection between object orientation and functional programming. He is a member of the Engineering and computer science faculty at Victoria University of Wellington. He is doing a programming language called 42, based on enforcing radical security and safe metaprogramming. More information about his research at <a href=\"https://Forty2.is\">https://Forty2.is</a> or <a href=\"https://www.youtube.com/MarcoServetto\">https://www.youtube.com/MarcoServetto</a>",
        "image": "./images/seminars/marcoservetto.jpeg",
        "when": "31th of October, 2023",
        "where": "Valletta Puggia, Room 322"
    },
    {
        "title": "Doctrines of Logic",
        "speaker": "Giuseppe Rosolini",
        "affiliation": "University of Genoa",
        "abstract": "One of the great achievements in the mathematical work of F.W. Lawvere has been that of redesigning the algebraic perspective on logic by means of categories. In a series of seminal papers, he presented a radically new approach to the algebra of logic, which has been proved extremely fruitful in the following years. They go under the name of doctrines. We shall argue that the power of doctrines rests on its unifying aspects, and we shall present by examples how the structural perspective offers powerful tools for both theoretical studies and applications.",
        "bio": "Professor of Mathematical Logic, Giuseppe Rosolini teaches at the Department of Mathematics at the University of Genoa. He earned his Ph.D. in Mathematics at the University of Oxford. He is a regular member of the Virgilian Academy, a member of the Italian Association of Logic and Applications, and is part of the editorial board of the Journal of Pure and Applied Algebra, Theory and Applications of Categories, and La Matematica nella Società e nella Cultura. Author of numerous scientific publications, a visiting professor at several Italian and foreign universities, he co-authored the book 'Mathematics at the Bar' with Roberto Lucchetti, published by FrancoAngeli. He is the creator and organizer of the team mathematics competition.",
        "image": "./images/seminars/giusepperosolini.jpeg",
        "when": "19th of October, 2023",
        "where": "Valletta Puggia, Room 217"
    },
    {
        "title": "Runtime Verification as a Toolkit of Techniques for Cyber Security Monitoring",
        "speaker": "Christian Colombo",
        "affiliation": "University of Malta",
        "abstract": "Runtime verification now has two decades of experience in developing a toolkit of techniques aimed at facilitating monitoring through wide-ranging contributions: from domain-specification language design, to compilation of properties, to intrusiveness mitigation techniques. This talk will provide a quick tour of the RV toolkit, evolving into how this benefits cyber security. In this context, RV can (amongst other things) help in monitoring the execution of security protocols, enforce isolation of a trusted execution environment, and extract evidence which would otherwise be hard to obtain.",
        "bio": "Christian Colombo obtained his PhD in Computer Science from the University of  Malta in 2013 and currently holds the position of Senior Lecturer within the Department of Computer Science. His main areas of research are runtime verification, software testing, compensating transactions, and domain-specific languages, focusing on the creation of dependable software systems by verifying them against formal specifications at runtime. The applications of this body of research, spans mobile device security, payment gateway systems, social network privacy policies, tax compliance, and cyber security, amongst others. He is actively involved in outreach activities both at department and faculty level, engaging with potential future students, industry, and the general public.",
        "image": "./images/seminars/christiancolombo.jpeg",
        "when": "21st of April, 2023",
        "where": "Valletta Puggia, Room 322"
    }
]
