[
    {
        "title": "Enforcing Modular Security through Language Design: A Study on Object and Reference Capabilities",
        "speaker": "Marco Servetto",
        "affiliation": "Victoria University of Wellington, NZ",
        "abstract": "We present an approach to language design aimed at enforcing modular security, where a security architect can define specific object capabilities that enforce custom security properties. Unlike traditional models that assume an uncompromised system ('clean garden'), this model ('dark forest') assumes local machines are already compromised but anchored by a secure root. Security is maintained even in the presence of adversarial code execution within security-critical processes: a process may be rendered inert, or be subjected to crashes or infinite loops, but it is precluded from engaging in insecure interactions.",
        "bio": "Marco Servetto is a researcher in Programming languages, type and theory. He is interested in the formal modelling of the semantic of programming languages, with a focus on the intersection between object orientation and functional programming. He is a member of the Engineering and computer science faculty at Victoria University of Wellington. He is doing a programming language called 42, based on enforcing radical security and safe metaprogramming. More information about his research at <a href=\"https://Forty2.is\">https://Forty2.is</a> or <a href=\"https://www.youtube.com/MarcoServetto\">https://www.youtube.com/MarcoServetto</a>",
        "image": "./images/seminars/marcoservetto.jpeg",
        "when": "31th of October, 2023",
        "where": "Valletta Puggia, Room 322"
    },
    {
        "title": "Doctrines of Logic",
        "speaker": "Giuseppe Rosolini",
        "affiliation": "University of Genoa",
        "abstract": "One of the great achievements in the mathematical work of F.W. Lawvere has been that of redesigning the algebraic perspective on logic by means of categories. In a series of seminal papers, he presented a radically new approach to the algebra of logic, which has been proved extremely fruitful in the following years. They go under the name of doctrines. We shall argue that the power of doctrines rests on its unifying aspects, and we shall present by examples how the structural perspective offers powerful tools for both theoretical studies and applications.",
        "bio": "Professor of Mathematical Logic, Giuseppe Rosolini teaches at the Department of Mathematics at the University of Genoa. He earned his Ph.D. in Mathematics at the University of Oxford. He is a regular member of the Virgilian Academy, a member of the Italian Association of Logic and Applications, and is part of the editorial board of the Journal of Pure and Applied Algebra, Theory and Applications of Categories, and La Matematica nella Società e nella Cultura. Author of numerous scientific publications, a visiting professor at several Italian and foreign universities, he co-authored the book 'Mathematics at the Bar' with Roberto Lucchetti, published by FrancoAngeli. He is the creator and organizer of the team mathematics competition.",
        "image": "./images/seminars/giusepperosolini.jpeg",
        "when": "19th of October, 2023",
        "where": "Valletta Puggia, Room 217"
    },
    {
        "title": "Runtime Verification as a Toolkit of Techniques for Cyber Security Monitoring",
        "speaker": "Christian Colombo",
        "affiliation": "University of Malta",
        "abstract": "Runtime verification now has two decades of experience in developing a toolkit of techniques aimed at facilitating monitoring through wide-ranging contributions: from domain-specification language design, to compilation of properties, to intrusiveness mitigation techniques. This talk will provide a quick tour of the RV toolkit, evolving into how this benefits cyber security. In this context, RV can (amongst other things) help in monitoring the execution of security protocols, enforce isolation of a trusted execution environment, and extract evidence which would otherwise be hard to obtain.",
        "bio": "Christian Colombo obtained his PhD in Computer Science from the University of  Malta in 2013 and currently holds the position of Senior Lecturer within the Department of Computer Science. His main areas of research are runtime verification, software testing, compensating transactions, and domain-specific languages, focusing on the creation of dependable software systems by verifying them against formal specifications at runtime. The applications of this body of research, spans mobile device security, payment gateway systems, social network privacy policies, tax compliance, and cyber security, amongst others. He is actively involved in outreach activities both at department and faculty level, engaging with potential future students, industry, and the general public.",
        "image": "./images/seminars/christiancolombo.jpeg",
        "when": "21st of April, 2023",
        "where": "Valletta Puggia, Room 322"
    }
]
