[
    {
        "title": "Lawvere Metric Spaces and Quantales",
        "speaker": "Eugenio Moggi",
        "affiliation": "University of Genova",
        "abstract": "In a 1973 paper Lawvere proposes to view metric spaces as R-enriched categories.  We recall the definitions (metric space X, category C, monoidal category V, V-enriched category C) needed to understand Lawvere's contribution.  We consider a further generalization, where the quantale R is replaces by a generic quantale Q.  We give examples of quantales that arise in several contexts (e.g., in analysis of algorithms), and what are the additional properties of a quantale Q to relate Q-valued metric spaces to topological spaces.",
        "bio": "Professor Eugenio Moggi, MSc from Pisa (1983) and PhD from Edinburgh (1988), has worked at the Univ. of Cambridge, Edinburgh and Pisa, before moving to Genova in 1990.",
        "image": "./images/seminars/eugeniomoggi.jpeg",
        "when": "25th of March (15:00), 2024",
        "where": "Valletta Puggia, Room 218",
        "slides": "./data/slides/Moggi25032024.pdf"
    },
    {
        "title": "Verification of neural-symbolic agent systems",
        "speaker": "Elena Botoeva",
        "affiliation": "University of Kent",
        "abstract": "In this talk I will present a formalisation of closed loop systems comprising neural-symbolic agents and an approach to verify those using fragments of temporal logics. Here we assume a model of agents that are composed of a perception system implemented via feedforward neural networks and an action selection mechanism implemented via traditional control logic. This formalisation admits various instantiations: single or multiple agents, deterministic or non-deterministic environments.  We study the verification problem of such systems against temporal logic properties, for instance branching-time temporal logic (CTL) or alternating-time temporal logic (ATL). We show that verifying these systems against reachability properties is undecidable. We introduce bounded fragments of CTL and ATL, that can be used for identifying shallow bugs in the system, and prove that the verification problem against specifications in these fragments is in coNExpTime and PSpace-hard. We translate the verification problem on bounded traces into the feasibility problem of mixed integer linear programs and show the soundness and completeness of the translation. We present a tool implementing the compilation and evaluate the experimental results obtained on a complex scenario of multiple aircraft operating a recently proposed prototype for air-traffic collision avoidance (VCAS).",
        "bio": "Prior to joining Kent Elena was a Research Associate in the Verification of Autonomous Systems Group at Imperial College London and a Researcher in the KRDB Research Centre for Knowledge and Data at Free University of Bozen-Bolzano. She has a wide range of research experience with theoretical and practical AI problems such as query answering over ontologies, accessing relational and NoSQL databases using ontologies, and verification of autonomous systems with neural network components.",
        "image": "./images/seminars/elenabotoeva.jpeg",
        "when": "14th of February (14:00), 2024",
        "where": "Viale Causa 15, Aula Tagliasco"
    },
    {
        "title": "On the importance and role of Temporal and Epistemic Logics in Agents and Multi-Agent Systems",
        "speaker": "Stefania Costantini",
        "affiliation": "University of L'Aquila",
        "abstract": "In the multi-agent setting, it is relevant to model group dynamics of agents, and epistemic logic has proved a good tool. We illustrate an epistemic logic that allows one to formalise the new beliefs formed or removed by a group of agents where several groups can co-exist and where an agent can pass from one group to another. This accounts for modelling aspects of a \"Theory of Mind\" in Multi-Agent Systems. We present some significant case studies, arguing that the epistemic logic representation may enable explainability. We then discuss how temporal-logic-based representations enable forms of agents' run-time self-checking and self-improvement, complementary to other existing ones.",
        "bio": "Stefania Costantini, a Full Professor at the University of L'Aquila since 2005, is a leading expert in Artificial Intelligence (AI). As head of the AAAI@AQ Research Group, she focuses on Intelligent Agents, Answer Set Programming, and Cognitive Robotics. With 150+ international publications, Stefania is active in AI community leadership roles, including serving on conference committees and editorial boards. She is the President of GULP, holds key positions in AIxIA and ALP, and serves as an evaluator for national and international institutions. Stefania's global impact extends to projects like COST CA17124 'DIGital FORensics' and PRIN 2022 TrustPACTX, showcasing her leadership in European, Italian, and industrial AI initiatives.",
        "image": "./images/seminars/stefaniacostantini.jpeg",
        "when": "15th of January, 2024",
        "where": "Valletta Puggia, Room 711"
    },
    {
        "title": "Parameterised Verification of Networks with Rendez-Vous",
        "speaker": "Arnaud Sangnier",
        "affiliation": "University of Genoa",
        "abstract": "We investigate networks of processes using a finite-state protocol and rendezvous communication. Our focus is on verifying properties within this model. We revisit established results and the connection between these networks and Petri nets. Additionally, we introduce new findings concerning the possibility of determining a cutoff number for a given protocol. We establish decidability and complexity results under various assumptions. Further, we provide complexity results for safety verification under a relaxed rendezvous mechanism, aligning with synchronization in languages like Java. These findings are a collaboration with Florian Horn, Lucie Guillou, and Nathalie Sznajder.",
        "bio": "Arnaud Sangnier obtained his PhD at the Laboratoire Spécification et Vérification of ENS Cachan (France) in 2008. His doctoral thesis was on the automatic verification of programs manipulating pointers and counters. During the year 2009, he did a post-doctoral stay at the university of Torino where he studied together with Jeremy Sproston probabilistic systems equipped with counters à la Petri nets. After that he spent 9 month at Genova to work with Giorgio Delzanno on the verification of parameterized networks. From autumn 2010 to autumn 2023, he was associate professor at the University Paris Cité and member of the Institut de Recherche en Informatique Fondamentale (IRIF). He is now associate professor at the University of Genova and member of the Dipartimento di Informatica, Bioingegneria, Robotica e Ingegneria dei Sistemi (DIBRIS). During the last years he has continued to work in both directions of parameterized verification and analysis of systems with counters.",
        "image": "./images/seminars/arnaudsangnier.jpeg",
        "when": "21st of December, 2023",
        "where": "Valletta Puggia, Room 218"
    },
    {
        "title": "ML-based anomaly detection and Formal Methods for ML",
        "speaker": "Claudia Cavallaro",
        "affiliation": "University of Catania",
        "abstract": "Anomaly Detection is a field of data mining that deals with identifying data anomalies in a dataset. Anomalies can be due to measurement errors, unexpected events or malicious attacks. This talk aims to provide an overview of anomalies in fields such as industrial control systems, intrusion systems, the analysis of climate events, urban traffic, fake news and much more. Formal Methods provide a valuable aid to Anomaly Detection, supporting the learning process or data augmentation. Formal methods can improve the generalization of the resulting model after training and guide the learning process to respect certain properties such as constraints. Therefore, applications of Formal Methods  contribute to improving the robustness of Machine Learning (ML) models.",
        "bio": "Claudia Cavallaro is a Researcher in Computer Science at the University of Catania, works on Big Data, Optimization and Metaheuristics. She is a member of Complex Intelligent Systems Research Group of the Department of Mathematics and Computer Science of the University of Catania. She participated as a speaker at the conferences ITADATA 2023 (The 2nd Italian Conference on Big Data and Data Science) and WIVACE 2023 (XVII International Workshop on Artificial Life and Evolutionary Computing). She started working in the research field of Anomaly Detection since her postdoc position at the CNAF-I.N.F.N. from Bologna.",
        "image": "./images/seminars/claudiacavallaro.jpeg",
        "when": "22nd of November, 2023",
        "where": "Valletta Puggia, Room 218"
    },
    {
        "title": "Enforcing Modular Security through Language Design: A Study on Object and Reference Capabilities",
        "speaker": "Marco Servetto",
        "affiliation": "Victoria University of Wellington, NZ",
        "abstract": "We present an approach to language design aimed at enforcing modular security, where a security architect can define specific object capabilities that enforce custom security properties. Unlike traditional models that assume an uncompromised system ('clean garden'), this model ('dark forest') assumes local machines are already compromised but anchored by a secure root. Security is maintained even in the presence of adversarial code execution within security-critical processes: a process may be rendered inert, or be subjected to crashes or infinite loops, but it is precluded from engaging in insecure interactions.",
        "bio": "Marco Servetto is a researcher in Programming languages, type and theory. He is interested in the formal modelling of the semantic of programming languages, with a focus on the intersection between object orientation and functional programming. He is a member of the Engineering and computer science faculty at Victoria University of Wellington. He is doing a programming language called 42, based on enforcing radical security and safe metaprogramming. More information about his research at <a href=\"https://Forty2.is\">https://Forty2.is</a> or <a href=\"https://www.youtube.com/MarcoServetto\">https://www.youtube.com/MarcoServetto</a>",
        "image": "./images/seminars/marcoservetto.jpeg",
        "when": "31th of October, 2023",
        "where": "Valletta Puggia, Room 322"
    },
    {
        "title": "Doctrines of Logic",
        "speaker": "Giuseppe Rosolini",
        "affiliation": "University of Genoa",
        "abstract": "One of the great achievements in the mathematical work of F.W. Lawvere has been that of redesigning the algebraic perspective on logic by means of categories. In a series of seminal papers, he presented a radically new approach to the algebra of logic, which has been proved extremely fruitful in the following years. They go under the name of doctrines. We shall argue that the power of doctrines rests on its unifying aspects, and we shall present by examples how the structural perspective offers powerful tools for both theoretical studies and applications.",
        "bio": "Professor of Mathematical Logic, Giuseppe Rosolini teaches at the Department of Mathematics at the University of Genoa. He earned his Ph.D. in Mathematics at the University of Oxford. He is a regular member of the Virgilian Academy, a member of the Italian Association of Logic and Applications, and is part of the editorial board of the Journal of Pure and Applied Algebra, Theory and Applications of Categories, and La Matematica nella Società e nella Cultura. Author of numerous scientific publications, a visiting professor at several Italian and foreign universities, he co-authored the book 'Mathematics at the Bar' with Roberto Lucchetti, published by FrancoAngeli. He is the creator and organizer of the team mathematics competition.",
        "image": "./images/seminars/giusepperosolini.jpeg",
        "when": "19th of October, 2023",
        "where": "Valletta Puggia, Room 217"
    },
    {
        "title": "Runtime Verification as a Toolkit of Techniques for Cyber Security Monitoring",
        "speaker": "Christian Colombo",
        "affiliation": "University of Malta",
        "abstract": "Runtime verification now has two decades of experience in developing a toolkit of techniques aimed at facilitating monitoring through wide-ranging contributions: from domain-specification language design, to compilation of properties, to intrusiveness mitigation techniques. This talk will provide a quick tour of the RV toolkit, evolving into how this benefits cyber security. In this context, RV can (amongst other things) help in monitoring the execution of security protocols, enforce isolation of a trusted execution environment, and extract evidence which would otherwise be hard to obtain.",
        "bio": "Christian Colombo obtained his PhD in Computer Science from the University of  Malta in 2013 and currently holds the position of Senior Lecturer within the Department of Computer Science. His main areas of research are runtime verification, software testing, compensating transactions, and domain-specific languages, focusing on the creation of dependable software systems by verifying them against formal specifications at runtime. The applications of this body of research, spans mobile device security, payment gateway systems, social network privacy policies, tax compliance, and cyber security, amongst others. He is actively involved in outreach activities both at department and faculty level, engaging with potential future students, industry, and the general public.",
        "image": "./images/seminars/christiancolombo.jpeg",
        "when": "21st of April, 2023",
        "where": "Valletta Puggia, Room 322"
    }
]
